of70/tutorials/rheoBDFoam/flowFocusing/pressureDrivenFlow/flowSimulation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletNorth
    {
	type            fixedValue;
	value           uniform (0 -4.54315e-05 0);    
    }
    
    inletSouth
    {
	type            fixedValue;
	value           uniform (0 4.54315e-05 0);    
    }
    
    inletWest
    {
	type            fixedValue;
	value           uniform (2.27158e-06 0 0);    
    }
      
    "(walls|frontAndBack)" 
    {
	type            fixedValue;
	value           uniform (0 0 0);      
    }

    outlet
    {
	type            zeroGradient;     
    }
}
  

// ************************************************************************* //
